#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.www_staging_plancraftr_com: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket.staging_plancraftr_com: Refreshing state... [id=staging.plancraftr.com]
aws_security_group.staging_server_plancraftr_sg: Refreshing state... [id=sg-09617ef95acbe046f]
aws_instance.staging_server_plancraftr: Refreshing state... [id=i-07149a3437bb4f10e]
aws_route53_record.staging_api_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_staging.api.plancraftr.com_A]
aws_s3_bucket_website_configuration.static_website_config_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket_public_access_block.allow_public_access_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_cloudfront_distribution.www_staging_distribution: Refreshing state... [id=EL6JXWU4CGSQG]
aws_s3_bucket_website_configuration.static_website_config_s3_staging: Refreshing state... [id=staging.plancraftr.com]
aws_s3_bucket_public_access_block.allow_public_access_s3_staging: Refreshing state... [id=staging.plancraftr.com]
aws_cloudfront_distribution.staging_distribution: Refreshing state... [id=EVXVZ94PZN75P]
aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_route53_record.staging_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_staging.plancraftr.com_A]
aws_route53_record.www_staging_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_www.staging.plancraftr.com_A]
aws_s3_bucket_policy.allow_anyone_get_objects_s3_staging: Refreshing state... [id=staging.plancraftr.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.www_staging_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "www_staging_distribution" {
        id                             = "EL6JXWU4CGSQG"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_function.routing_handler will be created
  + resource "aws_cloudfront_function" "routing_handler" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
            
              if (!request.uri.includes(".")) {
                request.uri = "/";
                request.querystring = {};
              }
            
              return request;
            }
        EOT
      + comment         = "handle routing"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "routing_handler"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*